---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.JoistSystemNewBeamTypeNoFamNameParam
source: html/6570f665-17f4-d3b7-7983-2053fb6a3826.htm
---
# Autodesk.Revit.DB.ParameterTypeId.JoistSystemNewBeamTypeNoFamNameParam Property

"Beam Type (No Family Name)"

## Syntax (C#)
```csharp
public static ForgeTypeId JoistSystemNewBeamTypeNoFamNameParam { get; }
```